# Illuminance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InitialIlluminanceIntensity..::..Illuminance Property
InitialIlluminanceIntensity Class See Also
---
The illuminance intensity value.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Illuminance { get; set; }
```

Visual Basic
---
```text
Public Property Illuminance As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Illuminance {
	double get ();
	void set (double value);
}
```

# ### Field Value
The illuminance value in lx as a numerical value between 0 and 1e+30.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The illuminance value is not valid because it is not between 0 and 1e+30. |

# See Also
InitialIlluminanceIntensity Class
Autodesk.Revit.DB.Lighting Namespace